### (모듈 사용법)
1. import 라이브러리명(pandas)
    - 사용: pandas.모듈
2. import 라이브러리명(pandas) as pd
    - 사용: pd.모듈
3. from 라이브러리명 import 모듈

In [1]:
import pandas as pd
from pandas import Series, DataFrame

In [2]:
Series(data = [2500, 3800, 1200, 6000], index=["apple","banana","peer","cherry"])

apple     2500
banana    3800
peer      1200
cherry    6000
dtype: int64

In [3]:
Series(data = [2500, 3800, 1200, 6000])

0    2500
1    3800
2    1200
3    6000
dtype: int64

In [4]:
fruit = Series(data = [2500, 3800, 1200, 6000], index=["apple","banana","peer","cherry"])
fruit

apple     2500
banana    3800
peer      1200
cherry    6000
dtype: int64

In [5]:
type(fruit)

pandas.core.series.Series

In [6]:
fruit.values

array([2500, 3800, 1200, 6000], dtype=int64)

In [7]:
fruit.values[0]

2500

In [8]:
fruit.index

Index(['apple', 'banana', 'peer', 'cherry'], dtype='object')

In [9]:
fruit.index[0]

'apple'

In [10]:
fruitData = {"a": 2500, "b":3800, "c":1200, "d":6000}
fruitData

{'a': 2500, 'b': 3800, 'c': 1200, 'd': 6000}

In [11]:
type(fruitData)

dict

In [12]:
Series(fruitData)

a    2500
b    3800
c    1200
d    6000
dtype: int64

In [13]:
fruit

apple     2500
banana    3800
peer      1200
cherry    6000
dtype: int64

In [14]:
fruit.name = "fruitPrice"
fruit.index.name = "fruitName"
fruit

fruitName
apple     2500
banana    3800
peer      1200
cherry    6000
Name: fruitPrice, dtype: int64

In [15]:
# DataFrame 생성

fruitData = {"fruitName":["apple","banana","cherry","peer"],
                    "fruitPrice":[2500,3800,6000,1200],
                    "num": [10,5,3,8]}
fruitData

{'fruitName': ['apple', 'banana', 'cherry', 'peer'],
 'fruitPrice': [2500, 3800, 6000, 1200],
 'num': [10, 5, 3, 8]}

In [16]:
pd.DataFrame(fruitData)

  fruitName  fruitPrice  num
0     apple        2500   10
1    banana        3800    5
2    cherry        6000    3
3      peer        1200    8

In [17]:
fruitFrame = pd.DataFrame(fruitData)

In [18]:
fruitData = {"fruitName":["apple","banana","cherry","peer"],
                    "fruitPrice":[2500,3800,6000,1200],
                    "num": [10,5,3,8]}
# 컬럼 순서 변경
pd.DataFrame(fruitData, columns = ["fruitPrice","num12","fruitName"])

   fruitPrice num12 fruitName
0        2500   NaN     apple
1        3800   NaN    banana
2        6000   NaN    cherry
3        1200   NaN      peer

In [19]:
fruitFrame["fruitName"]

0     apple
1    banana
2    cherry
3      peer
Name: fruitName, dtype: object

In [20]:
type(fruitFrame["fruitName"])

pandas.core.series.Series

In [21]:
fruitFrame.fruitName

0     apple
1    banana
2    cherry
3      peer
Name: fruitName, dtype: object

In [22]:
# 컬럼 추가하기
# df["new컬럼명"] = 값

fruitFrame["year"] = 2016
fruitFrame

  fruitName  fruitPrice  num  year
0     apple        2500   10  2016
1    banana        3800    5  2016
2    cherry        6000    3  2016
3      peer        1200    8  2016

In [23]:
# df 컬럼 추가, 다른 데이터 값
# Series 데이터 만들어서 추가
variable = pd.Series([4, 2, 1], index=[0,2,3])
# variable
fruitFrame["stock"] = variable
fruitFrame

  fruitName  fruitPrice  num  year  stock
0     apple        2500   10  2016    4.0
1    banana        3800    5  2016    NaN
2    cherry        6000    3  2016    2.0
3      peer        1200    8  2016    1.0

In [24]:
# drop한 결과는 보여주되 데이터는 변경하지 않음
fruit.drop("banana")

fruitName
apple     2500
peer      1200
cherry    6000
Name: fruitPrice, dtype: int64

In [25]:
# drop한 결과를 보여주지 않고 반영
fruit.drop("banana",inplace=True)

In [26]:
fruit

fruitName
apple     2500
peer      1200
cherry    6000
Name: fruitPrice, dtype: int64

In [27]:
fruitData = {"fruitName":["apple","banana","cherry","peer"],
                    "fruitPrice":[2500,3800,6000,1200],
                    "num": [10,5,3,8]}
fruitData

{'fruitName': ['apple', 'banana', 'cherry', 'peer'],
 'fruitPrice': [2500, 3800, 6000, 1200],
 'num': [10, 5, 3, 8]}

In [28]:
# dict에서 키값으로 데이터 추출
fruitName = fruitData["fruitName"]
DataFrame(fruitData, columns=["fruitName","fruitPrice","num"])

  fruitName  fruitPrice  num
0     apple        2500   10
1    banana        3800    5
2    cherry        6000    3
3      peer        1200    8

In [29]:
fruitName

['apple', 'banana', 'cherry', 'peer']

In [48]:
fruitName = fruitData["fruitName"]
fruitFrame = DataFrame(fruitData, index=fruitName, columns=["fruitPrice","num"])

In [40]:
fruitFrame.drop("apple")

        fruitPrice  num
banana        3800    5
cherry        6000    3
peer          1200    8

In [50]:
fruitFrame.drop(["apple","peer"])

        fruitPrice  num
banana        3800    5
cherry        6000    3

In [51]:
fruitFrame

        fruitPrice  num
apple         2500   10
banana        3800    5
cherry        6000    3
peer          1200    8

In [33]:
# df 컬럼 삭제하기
fruitFrame3 = fruitFrame.drop("num", axis=1)

In [34]:
fruitFrame3

  fruitName  fruitPrice  year  stock
0     apple        2500  2016    4.0
1    banana        3800  2016    NaN
2    cherry        6000  2016    2.0
3      peer        1200  2016    1.0

In [35]:
# df에서 여러 컬럼 대상은 ("컬럼1","컬럼2"...) 리스트로 작업
fruitFrame.drop(["num","fruitPrice"], axis=1)

  fruitName  year  stock
0     apple  2016    4.0
1    banana  2016    NaN
2    cherry  2016    2.0
3      peer  2016    1.0

In [36]:
fruit = Series(data = [2500, 3800, 1200, 6000], index=["apple","banana","peer","cherry"])
fruit

apple     2500
banana    3800
peer      1200
cherry    6000
dtype: int64

In [37]:
# Series 항목 추출하기 (slice)
fruit["banana":"peer"]

banana    3800
peer      1200
dtype: int64

In [42]:
# DataFrame 항목 추출하기
fruitFrame["apple":"banana"]

        fruitPrice  num
apple         2500   10
banana        3800    5

In [43]:
# 컬럼 slice
fruitFrame[["fruitPrice","num"]]

        fruitPrice  num
apple         2500   10
banana        3800    5
cherry        6000    3
peer          1200    8

In [44]:
fruit1 = pd.Series([5,9,10,3],index=["ap","ba","ch","pe"])
fruit2 = pd.Series([3,2,9,5,10],index=["ap","or","ba","ch","ma"])

In [45]:
fruit1

ap     5
ba     9
ch    10
pe     3
dtype: int64

In [46]:
fruit2

ap     3
or     2
ba     9
ch     5
ma    10
dtype: int64

In [47]:
fruit1 + fruit2

ap     8.0
ba    18.0
ch    15.0
ma     NaN
or     NaN
pe     NaN
dtype: float64

In [55]:
fruitData1 = {"Oh":[4, 8, 3,5],"Te":[0,1,2,3]}
fruitFrame1 = pd.DataFrame(fruitData1,columns=["Oh","Te"],index=["ap","ba","ch","pe"])
fruitFrame1

    Oh  Te
ap   4   0
ba   8   1
ch   3   2
pe   5   3

In [57]:
fruitData2 = {"Oh":[3, 0, 2,1,7],"Co":[5,4,3,6,0]}
fruitFrame2 = pd.DataFrame(fruitData2,columns=["Oh","Co"],index=["ap","or","ba","ch","ma"])
fruitFrame2

    Oh  Co
ap   3   5
or   0   4
ba   2   3
ch   1   6
ma   7   0

In [58]:
fruitFrame1 + fruitFrame2

    Co    Oh  Te
ap NaN   7.0 NaN
ba NaN  10.0 NaN
ch NaN   4.0 NaN
ma NaN   NaN NaN
or NaN   NaN NaN
pe NaN   NaN NaN